module.exports = {
	comments: {
		popular: [
			{
				id: 1,
				user: {
					id: 1,
					fullname: 'Nims',
					avatarUrl:
						'https://leonardo.osnova.io/d0589c45-48fa-5b15-b3d8-8b89e190ed07/-/scale_crop/72x72/-/format/webp'
				},
				text: 'Нолан точно гений. Однако, все еще не такой гений как Габэн!',
				post: {
					id: 1,
					title: 'Сколько научных открытий...'
				},
				createdAt: new Date().toString()
			},
			{
				id: 2,
				user: {
					id: 1,
					fullname: 'Nims',
					avatarUrl:
						'https://leonardo.osnova.io/d0589c45-48fa-5b15-b3d8-8b89e190ed07/-/scale_crop/72x72/-/format/webp'
				},
				text: 'Нолан точно гений. Однако, все еще не такой гений как Габэн!',
				post: {
					id: 1,
					title: 'Сколько научных открытий...'
				},
				createdAt: new Date().toString()
			},
			{
				id: 3,
				user: {
					id: 2,
					fullname: 'Nimscore',
					avatarUrl:
						'https://leonardo.osnova.io/7161cd97-ffdc-1930-2b13-419de941c777/-/scale_crop/64x64/-/format/webp/'
				},
				text: 'Нолан точно гений. Однако, куда ему до Габэна!',
				post: {
					id: 1,
					title: 'Сколько научных открытий...'
				},
				createdAt: new Date().toString()
			}
		],
		new: [
			{
				id: 4,
				user: {
					id: 2,
					fullname: 'Nimscore',
					avatarUrl:
						'https://leonardo.osnova.io/7161cd97-ffdc-1930-2b13-419de941c777/-/scale_crop/64x64/-/format/webp/'
				},
				text: 'Нолан точно гений. Однако, куда ему до Габэна!',
				post: {
					id: 1,
					title: 'Сколько научных открытий...'
				},
				createdAt: new Date().toString()
			}
		]
	},
	publications: {
		popular: [
			{
				id: 1,
				user: {
					id: 1,
					fullname: 'Nims',
					avatarUrl:
						'https://leonardo.osnova.io/d0589c45-48fa-5b15-b3d8-8b89e190ed07/-/scale_crop/72x72/-/format/webp'
				},
				title:
					'Сколько научных открытий было сделано во время съемок Интерстеллара',
				text: 'Лет тридцать назад знаменитый Стивен Хокинг устроил своему другу, молодому физику и одинокому отцу Кипу Торну свидание вслепую с Линдой Обст, редактором раздела науки журнала The New-York Times Magazine и начинающим телепродюсером. Романа у парочки так и не вышло, зато образовалась крепкая дружба. Лет десять назад Линда и Кип загорелись идеей создать фильм, основанный на достижениях и знаниях современной науки. Они написали восьмистраничный набросок, где фигурировали, помимо прочего, целых шесть кротовых нор, пять черных дыр и загадочная раса инопланетян, живущих в «балке» — пространстве, имеющем минимум пять измерений. Одним из героев должен был стать Стивен Хокинг, который лично отправлялся в космос.  Предлагая свою идею киностудии, Торн поставил условие: все сюжетные ходы в фильме должны быть научно достоверны или хотя бы основаны на допустимых теориях и спекуляциях.  Идеей заинтересовалась студия Paramount, а в режиссерское кресло уселся сам Стивен Спилберг. Сценарий поручили младшему брату Кристофера Нолана Джонатану. Но затем начались трудности: из-за забастовки Гильдии сценаристов Джон прекратил работу над фильмом, затем ему пришлось переключиться на «Темного рыцаря», а Спилберг что-то не поделил с боссами Paramount и покинул проект. Торн пал было духом, но Линда не отчаялась и за пару недель нашла нового режиссера — Кристофера Нолана.  Старший Нолан привнес в «Интерстеллар» немало нового. Крис переписал сценарий, объединив его с собственными идеями, изначально предназначавшимися для совсем другого проекта. Финальный вариант был совсем не похож на изначальный восьмистраничный набросок, но Кип не расстроился, поскольку, с его точки зрения, Нолан почти всегда придерживался озвученного Торном принципа. Торн категорически возразил режиссеру лишь один раз — когда Крис придумал сцену, где герои двигались быстрее света. Кип две недели доказывал, почему это совершенно невозможно, и добился своего.  Вместе с тем Кип понимал, что Крис снимает художественное кино, поэтому то и дело закрывал глаза на мелкие неточности, нужные для усиления драматизма, и следил лишь, чтобы фантазию Нолана не уносило слишком далеко. Получилось ли у него? Давайте разберемся.',
				interaction: {
					views: '8',
					opens: '4',
					reposts: '87'
				},
				indicators: {
					likes: '3',
					comments: '88',
					bookmarks: '28'
				},
				category: {
					id: 1,
					title: 'Кино'
				},
				createdAt: new Date().toString()
			}
		]
	}
}
