module.exports = {
	// environment: {
	// 	media: [
	// 		{
	// 			project: {
	// 				selfProject: {
	// 					communityName: 'mustel',
	// 					siteUrl: 'mustel.ru',
	// 					SiteLogo:
	// 						'https://cdn.discordapp.com/attachments/868472815022657536/1184536486436163727/fire.svg',
	// 					bannerImg:
	// 						'https://cdn.discordapp.com/attachments/868472815022657536/1184446941384413254/banner.jpg?ex=658c012c&is=65798c2c&hm=c8b53e0602bd92d2fb51658517ed1208302b16d5a2c2e769ac2e89773a835eb6&',
	// 					loginModalImg:
	// 						'https://cdn.discordapp.com/attachments/868472815022657536/1184446941384413254/banner.jpg?ex=658c012c&is=65798c2c&hm=c8b53e0602bd92d2fb51658517ed1208302b16d5a2c2e769ac2e89773a835eb6&'
	// 				},
	// 				mustelProject: {
	// 					projectVersion: 'v0.0.1-alpha',
	// 					projectName: 'Mustel'
	// 				}
	// 			},
	// 			createdAt: new Date().toString()
	// 		}
	// 	]
	// },
	environment: {
		media: {
			project: [
				{
					selfproject: {
						communityname: 'mustel',
						siteurl: 'mustel.ru',
						sitelogo:
							'https://cdn.discordapp.com/attachments/868472815022657536/1184536486436163727/fire.svg',
						bannerimg:
							'https://cdn.discordapp.com/attachments/868472815022657536/1184446941384413254/banner.jpg?ex=658c012c&is=65798c2c&hm=c8b53e0602bd92d2fb51658517ed1208302b16d5a2c2e769ac2e89773a835eb6&',
						loginmodalimg:
							'https://cdn.discordapp.com/attachments/868472815022657536/1184446941384413254/banner.jpg?ex=658c012c&is=65798c2c&hm=c8b53e0602bd92d2fb51658517ed1208302b16d5a2c2e769ac2e89773a835eb6&'
					},
					mustelproject: {
						projectversion: 'v0.0.1-alpha',
						projectname: 'Mustel'
					},
					createdAt: new Date().toString()
				}
			]
		}
	},
	comments: {
		popular: [
			{
				id: 1,
				user: {
					id: 1,
					fullname: 'Nims',
					avatarUrl:
						'https://leonardo.osnova.io/d0589c45-48fa-5b15-b3d8-8b89e190ed07/-/scale_crop/72x72/-/format/webp'
				},
				text: 'Нолан точно гений. Однако, все еще не такой гений как Габэн!#1',
				post: {
					id: 1,
					title:
						'Сколько научных открытий было сделано во время съемок Интерстеллара'
				},
				createdAt: new Date().toString()
			},
			{
				id: 2,
				user: {
					id: 1,
					fullname: 'Nims',
					avatarUrl:
						'https://leonardo.osnova.io/d0589c45-48fa-5b15-b3d8-8b89e190ed07/-/scale_crop/72x72/-/format/webp'
				},
				text: 'Нолан точно гений. Однако, все еще не такой гений как Габэн!#2',
				post: {
					id: 1,
					title:
						'Сколько научных открытий было сделано во время съемок Интерстеллара'
				},
				createdAt: new Date().toString()
			},
			{
				id: 3,
				user: {
					id: 2,
					fullname: 'Nimscore',
					avatarUrl:
						'https://leonardo.osnova.io/7161cd97-ffdc-1930-2b13-419de941c777/-/scale_crop/64x64/-/format/webp/'
				},
				text: 'Нолан точно гений. Однако, куда ему до Габэна!#1',
				post: {
					id: 1,
					title:
						'Сколько научных открытий было сделано во время съемок Интерстеллара'
				},
				createdAt: new Date().toString()
			}
		],
		new: [
			{
				id: 4,
				user: {
					id: 2,
					fullname: 'Nimscore',
					avatarUrl:
						'https://leonardo.osnova.io/7161cd97-ffdc-1930-2b13-419de941c777/-/scale_crop/64x64/-/format/webp/'
				},
				text: 'Нолан точно гений. Однако, куда ему до Габэна!',
				post: {
					id: 1,
					title:
						'Сколько научных открытий было сделано во время съемок Интерстеллара'
				},
				createdAt: new Date().toString()
			}
		]
	},
	publications: {
		new: [
			{
				id: 1,
				user: {
					id: 1,
					fullname: 'Nims',
					avatarUrl:
						'https://leonardo.osnova.io/d0589c45-48fa-5b15-b3d8-8b89e190ed07/-/scale_crop/72x72/-/format/webp'
				},
				title:
					'Сколько научных открытий было сделано во время съемок Интерстеллара',
				img: 'https://cdn.discordapp.com/attachments/868472815022657536/1181541182938042469/blackhole.jpg',
				text: 'Лет тридцать назад знаменитый Стивен Хокинг устроил своему другу, молодому физику и одинокому отцу Кипу Торну свидание вслепую с Линдой Обст, редактором раздела науки журнала The New-York Times Magazine и начинающим телепродюсером. Романа у парочки так и не вышло, зато образовалась крепкая дружба. Лет десять назад Линда и Кип загорелись идеей создать фильм, основанный на достижениях и знаниях современной науки. Они написали восьмистраничный набросок, где фигурировали, помимо прочего, целых шесть кротовых нор, пять черных дыр и загадочная раса инопланетян, живущих в «балке» — пространстве, имеющем минимум пять измерений. Одним из героев должен был стать Стивен Хокинг, который лично отправлялся в космос.  Предлагая свою идею киностудии, Торн поставил условие: все сюжетные ходы в фильме должны быть научно достоверны или хотя бы основаны на допустимых теориях и спекуляциях.  Идеей заинтересовалась студия Paramount, а в режиссерское кресло уселся сам Стивен Спилберг. Сценарий поручили младшему брату Кристофера Нолана Джонатану. Но затем начались трудности: из-за забастовки Гильдии сценаристов Джон прекратил работу над фильмом, затем ему пришлось переключиться на «Темного рыцаря», а Спилберг что-то не поделил с боссами Paramount и покинул проект. Торн пал было духом, но Линда не отчаялась и за пару недель нашла нового режиссера — Кристофера Нолана.  Старший Нолан привнес в «Интерстеллар» немало нового. Крис переписал сценарий, объединив его с собственными идеями, изначально предназначавшимися для совсем другого проекта. Финальный вариант был совсем не похож на изначальный восьмистраничный набросок, но Кип не расстроился, поскольку, с его точки зрения, Нолан почти всегда придерживался озвученного Торном принципа. Торн категорически возразил режиссеру лишь один раз — когда Крис придумал сцену, где герои двигались быстрее света. Кип две недели доказывал, почему это совершенно невозможно, и добился своего.  Вместе с тем Кип понимал, что Крис снимает художественное кино, поэтому то и дело закрывал глаза на мелкие неточности, нужные для усиления драматизма, и следил лишь, чтобы фантазию Нолана не уносило слишком далеко. Получилось ли у него? Давайте разберемся.',
				interaction: {
					views: '8760',
					opens: '4245',
					reposts: '87'
				},
				indicators: {
					likes: '2458',
					comments: '88',
					bookmarks: '28'
				},
				category: {
					id: 1,
					title: 'Кино'
				},
				createdAt: new Date().toString()
			},
			{
				id: 2,
				user: {
					id: 2,
					fullname: 'Nimscore',
					avatarUrl:
						'https://leonardo.osnova.io/7161cd97-ffdc-1930-2b13-419de941c777/-/scale_crop/64x64/-/format/webp/'
				},
				title:
					'Сколько научных открытий было сделано во время съемок Интерстеллара',
				img: 'https://cdn.discordapp.com/attachments/868472815022657536/1181545611435196607/1746065.jpg',
				text: 'Лет тридцать назад знаменитый Стивен Хокинг устроил своему другу, молодому физику и одинокому отцу Кипу Торну свидание вслепую с Линдой Обст, редактором раздела науки журнала The New-York Times Magazine и начинающим телепродюсером. Романа у парочки так и не вышло, зато образовалась крепкая дружба. Лет десять назад Линда и Кип загорелись идеей создать фильм, основанный на достижениях и знаниях современной науки. Они написали восьмистраничный набросок, где фигурировали, помимо прочего, целых шесть кротовых нор, пять черных дыр и загадочная раса инопланетян, живущих в «балке» — пространстве, имеющем минимум пять измерений. Одним из героев должен был стать Стивен Хокинг, который лично отправлялся в космос.  Предлагая свою идею киностудии, Торн поставил условие: все сюжетные ходы в фильме должны быть научно достоверны или хотя бы основаны на допустимых теориях и спекуляциях.  Идеей заинтересовалась студия Paramount, а в режиссерское кресло уселся сам Стивен Спилберг. Сценарий поручили младшему брату Кристофера Нолана Джонатану. Но затем начались трудности: из-за забастовки Гильдии сценаристов Джон прекратил работу над фильмом, затем ему пришлось переключиться на «Темного рыцаря», а Спилберг что-то не поделил с боссами Paramount и покинул проект. Торн пал было духом, но Линда не отчаялась и за пару недель нашла нового режиссера — Кристофера Нолана.  Старший Нолан привнес в «Интерстеллар» немало нового. Крис переписал сценарий, объединив его с собственными идеями, изначально предназначавшимися для совсем другого проекта. Финальный вариант был совсем не похож на изначальный восьмистраничный набросок, но Кип не расстроился, поскольку, с его точки зрения, Нолан почти всегда придерживался озвученного Торном принципа. Торн категорически возразил режиссеру лишь один раз — когда Крис придумал сцену, где герои двигались быстрее света. Кип две недели доказывал, почему это совершенно невозможно, и добился своего.  Вместе с тем Кип понимал, что Крис снимает художественное кино, поэтому то и дело закрывал глаза на мелкие неточности, нужные для усиления драматизма, и следил лишь, чтобы фантазию Нолана не уносило слишком далеко. Получилось ли у него? Давайте разберемся.',
				interaction: {
					views: '6739',
					opens: '5791',
					reposts: '168'
				},
				indicators: {
					likes: '4393',
					comments: '243',
					bookmarks: '54'
				},
				category: {
					id: 1,
					title: 'Кино'
				},
				createdAt: new Date().toString()
			}
		]
	},
	users: {
		new: [
			{
				id: 1,
				user: {
					id: 1,
					fullname: 'Nims',
					avatarUrl:
						'https://leonardo.osnova.io/d0589c45-48fa-5b15-b3d8-8b89e190ed07/-/scale_crop/72x72/-/format/webp'
				},
				title:
					'Сколько научных открытий было сделано во время съемок Интерстеллара',
				img: 'https://cdn.discordapp.com/attachments/868472815022657536/1181541182938042469/blackhole.jpg?ex=65816ef9&is=656ef9f9&hm=ad6d6b1592283fca4b8f468b29cf141569604ace22de6e236521eb269fbc7083&',
				text: '',
				interaction: {
					views: '8760',
					opens: '4245',
					reposts: '87'
				},
				indicators: {
					likes: '2458',
					comments: '88',
					bookmarks: '28'
				},
				category: {
					id: 1,
					title: 'Кино'
				},
				createdAt: new Date().toString()
			},
			{
				id: 2,
				user: {
					id: 2,
					fullname: 'Nimscore',
					avatarUrl:
						'https://leonardo.osnova.io/7161cd97-ffdc-1930-2b13-419de941c777/-/scale_crop/64x64/-/format/webp/'
				},
				title:
					'Сколько научных открытий было сделано во время съемок Интерстеллара',
				img: 'https://cdn.discordapp.com/attachments/868472815022657536/1181545611435196607/1746065.jpg?ex=65817319&is=656efe19&hm=4d1ee395397febd86b7acdd03b9db064066306cf482acfc2e11e3742ea4b5908&',
				text: '',
				interaction: {
					views: '6739',
					opens: '5791',
					reposts: '168'
				},
				indicators: {
					likes: '4393',
					comments: '243',
					bookmarks: '54'
				},
				category: {
					id: 1,
					title: 'Кино'
				},

				createdAt: new Date().toString()
			}
		]
	}
}
